
===
Empty Workspace
===

workspace "gnu" "bar" {
}

---

(dsl
  (workspace_declaration
    (string)
    (string)))

===
Workspace with empty model
===

workspace "gnu" "bar" {
  model {
  }
}

---

(dsl
  (workspace_declaration
    (string)
    (string)
    (model_declaration)))
      

===
Workspace with model & relation
===

workspace "gnu" "bar" {
  model {
    gnu -> bar "test"
  }
}

---

(dsl
  (workspace_declaration
    (string)
    (string)
    (model_declaration
      (relation_statement
        (relation_identifier)
        (relation_identifier)
        (string)))))

===
Workspace with model & inner relation
===

workspace "gnu" "bar" {
  model {
    gnu.child -> bar.prop "test"
  }
}

---

(dsl
  (workspace_declaration
    (string)
    (string)
    (model_declaration
      (relation_statement
        (relation_identifier)
        (relation_identifier)
        (string)))))
